Fs = 10e3;
t = 0:1/Fs:1; 
A = 2; 
f = 2e3;
signal = A * sin(2 * pi * f * t); 

SNR = 20;
P_signal = (A^2) / 2; 
P_noise = P_signal / (10^(SNR / 10)); 

noise = sqrt(P_noise) * randn(1, length(t)); 

s = signal + noise;

plot(t, s);
xlabel('Час (с)');
ylabel('Амплітуда');
title('Сигнал із шумом');

%   3. Аналіз сигналу: періодограма, спектрограма, метод Уелча.
%       Гармонійний сигнал: частота 1 кГц, амплітуда 4 В.
%       Білий шум Гауса: рівень на 10 дБ менший.
%       Частота дискретизації: 10 кГц.
%       Інтервал часу: 0…1 с.
%       Використовувати вікно Хеммінга тривалістю 200 із перекриттям 20 відліків.